{
  "meta": {
    "category": "consumer",
    "title": "Consumer",
    "icon": "",
    "updatedAt": "2025-11-07T00:00:20.203Z"
  },
  "intro": "# 02 - Consumer Analysis: Flavor Seekers\n\n**Analysis Date**: November 2025\n**Focus**: Target Audience Deep-Dive - Demographics, Psychographics, Behaviors\n**Primary Data Source**: MRI-Simmons 2025 Spring USA Study + Market Research\n\n---",
  "tldr": [
    {
      "title": "84%, 73%, 71%",
      "implication": "Flavor Seekers are adventurous Gen Z/Millennial fast-casual regulars (18-34) who treat meals as experiences, not transactions. They over-index massively on adventure sports (Index 641 snowmobiling, 496 rock climbing), emerging social platforms (Index 382 BeReal), and cultural exploration (Index 355 R&B/Hip-Hop concerts)—signaling thrill-seeking personalities who extend their boldness to food. 84% try social media food trends, 73% actively seek new cuisines, and 71% prioritize health-conscious restaurants. They're cross-shopping Chipotle, Sweetgreen, Shake Shack—hungry for the next format that balances flavor + health + customization. CAVA's Mediterranean positioning hits their sweet spot, but loyalty requires constant menu innovation and frictionless digital experiences.",
      "priority": "critical"
    }
  ],
  "situationSnapshot": "Flavor Seekers represent CAVA's core customer base: Gen Z-dominant (18-29 primary, extending to Millennials 30-40), urban/suburban, middle-to-upper income fast-casual regulars who've made Mediterranean bowls their go-to lunch ritual. MRI-Simmons data reveals they're 200% weighted CAVA customers, meaning they visit at twice the rate of average consumers—and their behavioral fingerprint is unmistakable. [Source: _CONSUMER-DATA-Flavor-Seekers.md]\n\nTheir psychographic profile defies stereotypes. Yes, they're health-conscious (71% actively seek restaurants prioritizing health), but they're equally thrill-seeking: 641 index on snowmobiling, 496 on rock climbing, 434 on obstacle races. They attend R&B/Hip-Hop concerts (355 index), play paintball (355), kayak/canoe (362), and were early BeReal adopters (382)—a constellation of behaviors signaling adventurous, socially connected, experience-driven personalities who refuse to compromise on any dimension of life. [Source: _CONSUMER-DATA-Flavor-Seekers.md]\n\nFood decision-making mirrors this multidimensionality. 73% like trying new cuisines, 50% want more meals with unique flavors, yet 71% of restaurant-goers 20-29 actively seek health-conscious options. [Source: https://www.supplysidefbj.com/market-trends-analysis/keys-to-food-beverage-product-success-for-gen-z] They're not choosing between taste and wellness—they demand both. Mediterranean cuisine solves this tension: bold harissa flavors + fresh vegetables + customizable proteins + health halo from global diet rankings.\n\nSocial media dictates their restaurant discovery and frequency. 84% try social media food trends, 70% use TikTok for food recommendations, 55% visit restaurants after seeing menus on TikTok. [Source: https://www.fb101.com/why-84-of-gen-z-are-trying-social-media-food-trends-and-what-that-means-for-restaurant-marketing/] Instagram and TikTok have replaced Google/Yelp as primary research tools. They're checking feeds, watching creator reviews, and seeking Instagram-worthy moments before deciding where to eat—making visual appeal and shareability non-negotiable.\n\nLoyalty is earned through value (60% prioritize discounts/deals) and convenience (38% need seamless apps/ordering), but brand allegiance is fragile. They're cross-shopping Chipotle, Panera, Chick-fil-A, Shake Shack, Five Guys, Sweetgreen—willing to switch for better experience, novelty, or perceived value. [Source: https://www.fastcasual.com/blogs/loyalty-programs-what-customers-value-most/] Fast casual is their default (36% cite as preference vs. 26% family-style, 15% bar/grill), with 53% ordering more than a year ago. [Source: https://www.getflavor.com/gen-z-by-the-numbers/]\n\n---",
  "story": null,
  "findings": [
    {
      "sectionTitle": "Demographic & Psychographic Profile",
      "cards": [
        {
          "title": "Flavor Seekers: The Adventurous Fast-Casual Core",
          "content": "Flavor Seekers represent CAVA's core customer base: Gen Z-dominant (18-29 primary, extending to Millennials 30-40), urban/suburban, middle-to-upper income fast-casual regulars who've made Mediterranean bowls their go-to lunch ritual. MRI-Simmons data reveals they're 200% weighted CAVA customers, meaning they visit at twice the rate of average consumers. Their psychographic profile defies stereotypes—yes, they're health-conscious (71% actively seek restaurants prioritizing health), but they're equally thrill-seeking: 641 index on snowmobiling, 496 on rock climbing, 434 on obstacle races. They attend R&B/Hip-Hop concerts (355 index), play paintball (355), kayak/canoe (362), and were early BeReal adopters (382)—a constellation of behaviors signaling adventurous, socially connected, experience-driven personalities who refuse to compromise on any dimension of life.\n\n[Source: _CONSUMER-DATA-Flavor-Seekers.md]",
          "priority": "critical"
        },
        {
          "title": "Multidimensional Food Decision-Making",
          "content": "Food decision-making mirrors this multidimensionality: 73% like trying new cuisines, 50% want more meals with unique flavors, yet 71% of restaurant-goers ages 20-29 actively seek health-conscious options. They're not choosing between taste and wellness—they demand both simultaneously. Mediterranean cuisine solves this tension: bold harissa flavors + fresh vegetables + customizable proteins + health halo from global diet rankings. The strategic insight: Flavor Seekers won't compromise—brands must deliver on multiple value propositions (flavor, health, customization, experience) or lose to competitors who can.\n\n[Source: https://www.supplysidefbj.com/market-trends-analysis/keys-to-food-beverage-product-success-for-gen-z]",
          "priority": "critical"
        }
      ],
      "isExpandable": true
    },
    {
      "sectionTitle": "Digital Behavior & Discovery Patterns",
      "cards": [
        {
          "title": "Social Media Drives Restaurant Discovery",
          "content": "Social media dictates their restaurant discovery and frequency: 84% try social media food trends, 70% use TikTok for food recommendations, 55% visit restaurants after seeing menus on TikTok. Instagram and TikTok have replaced Google/Yelp as primary research tools. They're checking feeds, watching creator reviews, and seeking Instagram-worthy moments before deciding where to eat—making visual appeal and shareability non-negotiable for restaurant brands. The implication: traditional advertising reach metrics are obsolete; what matters is creator partnerships, user-generated content amplification, and platform-native content that feels organic rather than branded.\n\n[Source: https://www.fb101.com/why-84-of-gen-z-are-trying-social-media-food-trends-and-what-that-means-for-restaurant-marketing/]",
          "priority": "important"
        }
      ],
      "isExpandable": false
    },
    {
      "sectionTitle": "Loyalty Dynamics & Cross-Shopping Behavior",
      "cards": [
        {
          "title": "Fragile Brand Allegiance & Value Expectations",
          "content": "Loyalty is earned through value (60% prioritize discounts/deals) and convenience (38% need seamless apps/ordering), but brand allegiance is fragile. They're cross-shopping Chipotle, Panera, Chick-fil-A, Shake Shack, Five Guys, Sweetgreen—willing to switch for better experience, novelty, or perceived value. Fast casual is their default (36% cite as preference vs. 26% family-style, 15% bar/grill), with 53% ordering more than a year ago. The challenge: convert occasional visitors (1-2x/month) into weekly loyalists (2-3x/week) through gamification, personalized offers, and habit-forming digital experiences. Every meal occasion is contested—CAVA competes for \"lunch today\" against all fast-casual options, not just Mediterranean subset.\n\n[Source: https://www.fastcasual.com/blogs/loyalty-programs-what-customers-value-most/]\n[Source: https://www.getflavor.com/gen-z-by-the-numbers/]",
          "priority": "important"
        }
      ],
      "isExpandable": false
    }
  ]
}